---
kind: property
id: P:Autodesk.Revit.DB.FailureResolution.IsValidObject
source: html/24b14505-d558-57a8-60e5-c93fb54cbb8d.htm
---
# Autodesk.Revit.DB.FailureResolution.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.